# Top Level Design Parameters
set_max_fanout 20.000000 {top} 

# Clocks
create_clock -period 20.000000 -waveform {0.000000 10.000000} -name PF1_ETXCLK [get_ports {PF1_ETXCLK}] 
set_clock_uncertainty 0.100000 [get_ports {PF1_ETXCLK}] 
create_clock -period 20.000000 -waveform {0.000000 10.000000} -name PG1_ERXCLK [get_ports {PG1_ERXCLK}] 
set_clock_uncertainty 0.100000 [get_ports {PG1_ERXCLK}] 
create_clock -period 6.000000 -waveform {0.000000 3.000000} -name pll_clk [get_pins {pll0/CKOUT}]
set_clock_uncertainty 0.100000 [get_pins {pll0/CKOUT}] 
create_clock -period 6.000000 -waveform {0.000000 3.000000} -name xtal_clk [get_pins {pads0/PAD_MX1_CK/O}]
set_clock_uncertainty 0.100000 [get_pins {pads0/PAD_MX1_CK/O}] 
create_generated_clock -divide_by 2 -name clk_e -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/clk_e_int_reg/Q}] 
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/clk_e_int_reg/Q}] 
create_generated_clock -divide_by 90 -name clk_u -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/clk_u_int_reg/Q}]
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/clk_u_int_reg/Q}] 
create_generated_clock -divide_by 2 -name clk_i -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/clk_i_int_reg/Q}]
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/clk_i_int_reg/Q}] 
create_generated_clock -divide_by 2 -name clk_c2 -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/even_c_reg/Q}]
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/even_c_reg/Q}] 
create_generated_clock -divide_by 18 -name clk_a -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/clk_a_int_reg/Q}]
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/clk_a_int_reg/Q}] 
create_generated_clock -divide_by 2 -name clk_s -source [get_pins {pll0/CKOUT}] [get_pins {clk_gen0/clk_s_int_reg/Q}]
set_clock_uncertainty 0.100000 [get_pins {clk_gen0/clk_s_int_reg/Q}] 
create_generated_clock -divide_by 2 -name clk_ICLK -source [get_pins {pll0/CKOUT}] [get_pins {pads0/PAD_PJ7_ICLK/IO}]
set_clock_uncertainty 0.100000 [get_ports {PJ7_ICLK}] 
create_generated_clock -multiply_by 1 -name clk_DCLK -source [get_pins {pll0/CKOUT}] [get_pins {pads0/PAD_DCLK/O}]
set_clock_uncertainty 0.100000 [get_ports {DCLK}] 

# Virtual Clocks
create_clock -period 20.000000 -waveform {0.000000 10.000000} -name clk_ETXCLK
set_clock_uncertainty 0.100000 clk_ETXCLK
create_clock -period 20.000000 -waveform {0.000000 10.000000} -name clk_ERXCLK
set_clock_uncertainty 0.100000 clk_ERXCLK

# False Paths Between Clocks
set_false_path -from clk_ICLK -to clk_ETXCLK
set_false_path -from clk_ICLK -to PF1_ETXCLK
set_false_path -from clk_DCLK -to clk_ETXCLK
set_false_path -from clk_DCLK -to PF1_ETXCLK
set_false_path -from clk_u -to clk_ETXCLK
set_false_path -from clk_u -to PF1_ETXCLK
set_false_path -from clk_a -to clk_ETXCLK
set_false_path -from clk_a -to PF1_ETXCLK
set_false_path -from clk_s -to clk_ETXCLK
set_false_path -from clk_s -to PF1_ETXCLK
set_false_path -from pll_clk -to clk_ETXCLK
set_false_path -from pll_clk -to PF1_ETXCLK
set_false_path -from xtal_clk -to clk_ETXCLK
set_false_path -from xtal_clk -to PF1_ETXCLK
set_false_path -from clk_i -to clk_ETXCLK
set_false_path -from clk_i -to PF1_ETXCLK
set_false_path -from clk_e -to clk_ETXCLK
set_false_path -from clk_e -to PF1_ETXCLK
set_false_path -from clk_c2 -to clk_ETXCLK
set_false_path -from clk_c2 -to PF1_ETXCLK
set_false_path -from clk_ICLK -to clk_ERXCLK
set_false_path -from clk_ICLK -to PG1_ERXCLK
set_false_path -from clk_DCLK -to clk_ERXCLK
set_false_path -from clk_DCLK -to PG1_ERXCLK
set_false_path -from clk_u -to clk_ERXCLK
set_false_path -from clk_u -to PG1_ERXCLK
set_false_path -from clk_a -to clk_ERXCLK
set_false_path -from clk_a -to PG1_ERXCLK
set_false_path -from clk_s -to clk_ERXCLK
set_false_path -from clk_s -to PG1_ERXCLK
set_false_path -from pll_clk -to clk_ERXCLK
set_false_path -from pll_clk -to PG1_ERXCLK
set_false_path -from xtal_clk -to clk_ERXCLK
set_false_path -from xtal_clk -to PG1_ERXCLK
set_false_path -from clk_i -to clk_ERXCLK
set_false_path -from clk_i -to PG1_ERXCLK
set_false_path -from clk_e -to clk_ERXCLK
set_false_path -from clk_e -to PG1_ERXCLK
set_false_path -from clk_c2 -to clk_ERXCLK
set_false_path -from clk_c2 -to PG1_ERXCLK
set_false_path -from clk_ETXCLK -to clk_ICLK
set_false_path -from clk_ETXCLK -to clk_DCLK
set_false_path -from clk_ETXCLK -to clk_u
set_false_path -from clk_ETXCLK -to clk_a
set_false_path -from clk_ETXCLK -to clk_s
set_false_path -from clk_ETXCLK -to pll_clk
set_false_path -from clk_ETXCLK -to xtal_clk
set_false_path -from clk_ETXCLK -to clk_i
set_false_path -from clk_ETXCLK -to clk_e
set_false_path -from clk_ETXCLK -to clk_c2
set_false_path -from PF1_ETXCLK -to clk_ICLK
set_false_path -from PF1_ETXCLK -to clk_DCLK
set_false_path -from PF1_ETXCLK -to clk_u
set_false_path -from PF1_ETXCLK -to clk_a
set_false_path -from PF1_ETXCLK -to clk_s
set_false_path -from PF1_ETXCLK -to pll_clk
set_false_path -from PF1_ETXCLK -to xtal_clk
set_false_path -from PF1_ETXCLK -to clk_i
set_false_path -from PF1_ETXCLK -to clk_e
set_false_path -from PF1_ETXCLK -to clk_c2
set_false_path -from clk_ETXCLK -to clk_ERXCLK
set_false_path -from clk_ETXCLK -to PG1_ERXCLK
set_false_path -from PF1_ETXCLK -to clk_ERXCLK
set_false_path -from PF1_ETXCLK -to PG1_ERXCLK
set_false_path -from clk_ERXCLK -to clk_ICLK
set_false_path -from clk_ERXCLK -to clk_DCLK
set_false_path -from clk_ERXCLK -to clk_u
set_false_path -from clk_ERXCLK -to clk_a
set_false_path -from clk_ERXCLK -to clk_s
set_false_path -from clk_ERXCLK -to pll_clk
set_false_path -from clk_ERXCLK -to xtal_clk
set_false_path -from clk_ERXCLK -to clk_i
set_false_path -from clk_ERXCLK -to clk_e
set_false_path -from clk_ERXCLK -to clk_c2
set_false_path -from PG1_ERXCLK -to clk_ICLK
set_false_path -from PG1_ERXCLK -to clk_DCLK
set_false_path -from PG1_ERXCLK -to clk_u
set_false_path -from PG1_ERXCLK -to clk_a
set_false_path -from PG1_ERXCLK -to clk_s
set_false_path -from PG1_ERXCLK -to pll_clk
set_false_path -from PG1_ERXCLK -to xtal_clk
set_false_path -from PG1_ERXCLK -to clk_i
set_false_path -from PG1_ERXCLK -to clk_e
set_false_path -from PG1_ERXCLK -to clk_c2
set_false_path -from clk_ERXCLK -to clk_ETXCLK
set_false_path -from clk_ERXCLK -to PF1_ETXCLK
set_false_path -from PG1_ERXCLK -to clk_ETXCLK
set_false_path -from PG1_ERXCLK -to PF1_ETXCLK

# Multicycle Constraints

# Point-to-point Delay Constraints
set_false_path -to [get_ports {MXOUT}] 
set_false_path -from [get_ports {MXOSC_S1}] 
set_false_path -from [get_ports {MXOSC_S0}] 
set_false_path -from [get_ports {MXOSC_FEB}] 
set_false_path -to [get_ports {MX2}] 
set_false_path -from [get_ports {MX2}] 
set_false_path -from [get_ports {MX1_CK}] 
set_false_path -from [get_ports {MWAKE}] 
set_false_path -from [get_ports {MTEST}] 
set_false_path -to [get_ports {MSDOUT}] 
set_false_path -from [get_ports {MSDIN}] 
set_false_path -to [get_ports {MRXOUT}] 
set_false_path -to [get_ports {MRSTOUT}] 
set_false_path -from [get_ports {MRESET}] 
set_false_path -from [get_ports {MPORDIS}] 
set_false_path -to [get_ports {MPLL_TSTO}] 
set_false_path -from [get_ports {MPLL_TSTO}] 
set_false_path -to [get_ports {MIRQOUT}] 
set_false_path -from [get_ports {MIRQ1}] 
set_false_path -from [get_ports {MIRQ0}] 
set_false_path -to [get_ports {MEXEC}] 
set_false_path -to [get_ports {MCKOUT1}] 
set_false_path -to [get_ports {MCKOUT0}] 
set_false_path -from [get_ports {MBYPASS}] 
set_false_path -from {core0/crb/en_iobus_int_reg[0]} 
set_false_path -from {core0/crb/en_iobus_int_reg[1]} 
set_false_path -from {core0/crb/en_eth_int_reg[0]} 
set_false_path -from {core0/crb/en_eth_int_reg[1]} 
set_false_path -from {core0/crb/en_uart3_int_reg} 
set_false_path -from {core0/crb/en_uart2_int_reg} 
set_false_path -from {core0/crb/en_uart1_int_reg} 
set_false_path -from {core0/crb/t_rp_int_reg[0]} 
set_false_path -from {core0/crb/t_rp_int_reg[1]} 
set_false_path -from {core0/crb/t_rcd_int_reg[0]} 
set_false_path -from {core0/crb/t_rcd_int_reg[1]} 
set_false_path -from {core0/crb/t_ras_int_reg[0]} 
set_false_path -from {core0/crb/t_ras_int_reg[1]} 
set_false_path -from {core0/crb/t_ras_int_reg[2]} 
set_false_path -from {core0/crb/fast_d_int_reg} 
set_false_path -from {core0/crb/dqm_size_int_reg[0]} 
set_false_path -from {core0/crb/dqm_size_int_reg[1]} 
set_false_path -from {core0/crb/c_size_int_reg[0]} 
set_false_path -from {core0/crb/c_size_int_reg[1]} 
set_false_path -from {core0/crb/r_size_int_reg[0]} 
set_false_path -from {core0/crb/r_size_int_reg[1]} 
set_false_path -from [get_ports {PC0_IDREQ4}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC1_IDREQ5}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC2_IDREQ6}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC3_IDREQ7}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC4_IDACK4}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC5_IDACK5}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC6_IDACK6}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -from [get_ports {PC7_IDACK7}]  -through [list [get_pins {peri0/ports/cpt_trig[7]}]  [get_pins {peri0/ports/cpt_trig[6]}]  [get_pins {peri0/ports/cpt_trig[5]}]  [get_pins {peri0/ports/cpt_trig[4]}]  [get_pins {peri0/ports/cpt_trig[3]}]  [get_pins {peri0/ports/cpt_trig[2]}]  [get_pins {peri0/ports/cpt_trig[1]}]  [get_pins {peri0/ports/cpt_trig[0]}] ]
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC0_IDREQ4}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC1_IDREQ5}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC2_IDREQ6}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC3_IDREQ7}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC4_IDACK4}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC5_IDACK5}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC6_IDACK6}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PC7_IDACK7}] 
set_false_path -through [list [get_pins {peri0/timer/pulseout[7]}]  [get_pins {peri0/timer/pulseout[6]}]  [get_pins {peri0/timer/pulseout[5]}]  [get_pins {peri0/timer/pulseout[4]}]  [get_pins {peri0/timer/pulseout[3]}]  [get_pins {peri0/timer/pulseout[2]}]  [get_pins {peri0/timer/pulseout[1]}]  [get_pins {peri0/timer/pulseout[0]}] ] -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/pen_int_reg[13][5]}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/pen_int_reg[13][4]}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/pen_int_reg[13][1]}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/pen_int_reg[13][0]}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/pen_int_reg[13][5]}  -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/pen_int_reg[13][3]}  -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/pen_int_reg[13][1]}  -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/pen_int_reg[13][0]}  -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/sft_out_reg}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/phen[7]}  -to [get_ports {PH7_IDACK3}] 
set_false_path -from {peri0/ports/phen[6]}  -to [get_ports {PH6_IDACK2}] 
set_false_path -from {peri0/ports/phen[5]}  -to [get_ports {PH5_IDACK1}] 
set_false_path -from {peri0/ports/phen[4]}  -to [get_ports {PH4_IDACK0}] 
set_false_path -from {peri0/ports/pcen[7]}  -to [get_ports {PC7_IDACK7}] 
set_false_path -from {peri0/ports/pcen[6]}  -to [get_ports {PC6_IDACK6}] 
set_false_path -from {peri0/ports/pcen[5]}  -to [get_ports {PC5_IDACK5}] 
set_false_path -from {peri0/ports/pcen[4]}  -to [get_ports {PC4_IDACK4}] 
set_false_path -from {peri0/ports/pjen[6]}  -to [get_ports {PJ6_ILIOA}] 
set_false_path -from {peri0/ports/pjen[5]}  -to [get_ports {PJ5_ILDOUT}] 
set_false_path -from {peri0/ports/pjen[4]}  -to [get_ports {PJ4_INEXT}] 
set_false_path -from {peri0/ports/pen_int_reg[3][7]}  -to [get_ports {PD7_DDQM7}] 
set_false_path -from {peri0/ports/pen_int_reg[3][6]}  -to [get_ports {PD6_DDQM6}] 
set_false_path -from {peri0/ports/pen_int_reg[3][5]}  -to [get_ports {PD5_DDQM5}] 
set_false_path -from {peri0/ports/pen_int_reg[3][4]}  -to [get_ports {PD4_DDQM4}] 
set_false_path -from {peri0/ports/pen_int_reg[3][3]}  -to [get_ports {PD3_DDQM3}] 
set_false_path -from {peri0/ports/pen_int_reg[3][2]}  -to [get_ports {PD2_DDQM2}] 
set_false_path -from {peri0/ports/pen_int_reg[3][1]}  -to [get_ports {PD1_DDQM1}] 
set_false_path -from {peri0/ports/pen_int_reg[3][0]}  -to [get_ports {PD0_DDQM0}] 
set_false_path -from {core0/tim/prescale3_reg[0]}  -through [list [get_pins {core0/crb/crb_out[0]}] ]
set_false_path -from {core0/tim/prescale3_reg[1]}  -through [list [get_pins {core0/crb/crb_out[1]}] ]
set_false_path -from {core0/tim/prescale3_reg[2]}  -through [list [get_pins {core0/crb/crb_out[2]}] ]
set_false_path -from {core0/tim/prescale3_reg[3]}  -through [list [get_pins {core0/crb/crb_out[3]}] ]
set_false_path -from {core0/tim/prescale3_reg[4]}  -through [list [get_pins {core0/crb/crb_out[4]}] ]
set_false_path -from {bmem} 
set_false_path -from clk_a -to [list [get_pins {peri0/ports/pi_latch_reg[*][*]/D}]]
set_multicycle_path 2 -through [list [get_pins {peri0/idreq[7]}]  [get_pins {peri0/idreq[6]}]  [get_pins {peri0/idreq[5]}]  [get_pins {peri0/idreq[4]}]  [get_pins {peri0/idreq[3]}]  [get_pins {peri0/idreq[2]}]  [get_pins {peri0/idreq[1]}]  [get_pins {peri0/idreq[0]}] ] -to {iomem1} 
set_multicycle_path 2 -through [list [get_pins {peri0/idreq[7]}]  [get_pins {peri0/idreq[6]}]  [get_pins {peri0/idreq[5]}]  [get_pins {peri0/idreq[4]}]  [get_pins {peri0/idreq[3]}]  [get_pins {peri0/idreq[2]}]  [get_pins {peri0/idreq[1]}]  [get_pins {peri0/idreq[0]}] ] -to {iomem0} 
set_multicycle_path 2 -through [list [get_pins {peri0/idreq[7]}]  [get_pins {peri0/idreq[6]}]  [get_pins {peri0/idreq[5]}]  [get_pins {peri0/idreq[4]}]  [get_pins {peri0/idreq[3]}]  [get_pins {peri0/idreq[2]}]  [get_pins {peri0/idreq[1]}]  [get_pins {peri0/idreq[0]}] ] -to {core0/ios/ios_dma0/ido_le_reg} 
set_multicycle_path 2 -from [get_ports {PI7_ID7}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI7_ID7}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI6_ID6}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI6_ID6}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI5_ID5}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI5_ID5}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI4_ID4}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI4_ID4}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI3_ID3}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI3_ID3}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI2_ID2}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI2_ID2}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI1_ID1}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI1_ID1}]  -to {iomem0} 
set_multicycle_path 2 -from [get_ports {PI0_ID0}]  -to {iomem1} 
set_multicycle_path 2 -from [get_ports {PI0_ID0}]  -to {iomem0} 
set_multicycle_path 2 -from {core0/pl_reg[3]}  -to {gmem} 
set_multicycle_path 2 -from {core0/pl_reg[4]}  -to {gmem} 
set_multicycle_path 2 -from {core0/pl_reg[5]}  -to {gmem} 
set_multicycle_path 2 -from {core0/pl_reg[6]}  -to {gmem} 
set_multicycle_path 2 -from {core0/pl_reg[7]}  -to {gmem} 
set_multicycle_path 2 -through [list [get_pins {core0/alu/ybus[7]}]  [get_pins {core0/alu/ybus[6]}]  [get_pins {core0/alu/ybus[5]}]  [get_pins {core0/alu/ybus[4]}]  [get_pins {core0/alu/ybus[3]}]  [get_pins {core0/alu/ybus[2]}]  [get_pins {core0/alu/ybus[1]}]  [get_pins {core0/alu/ybus[0]}] ] -to {gmem} 
set_multicycle_path 2 -through [list [get_pins {core0/dbus[7]}]  [get_pins {core0/dbus[6]}]  [get_pins {core0/dbus[5]}]  [get_pins {core0/dbus[4]}]  [get_pins {core0/dbus[3]}]  [get_pins {core0/dbus[2]}]  [get_pins {core0/dbus[1]}]  [get_pins {core0/dbus[0]}] ] -to {gmem} 
set_multicycle_path 2 -setup -from [get_clocks {clk_c2}] -through [get_pins {mprom1/OE}] -to [get_clocks {pll_clk}]

# False Path Constraints

# Output Load Constraints
set_load -max 10.000000 [get_ports {MX1_CK}] 
set_load -min 5.000000 [get_ports {MX1_CK}] 
set_load -max 10.000000 [get_ports {MX2}] 
set_load -min 5.000000 [get_ports {MX2}] 
set_load -max 10.000000 [get_ports {MXOUT}] 
set_load -min 5.000000 [get_ports {MXOUT}] 
set_load -max 10.000000 [get_ports {MEXEC}] 
set_load -min 5.000000 [get_ports {MEXEC}] 
set_load -max 10.000000 [get_ports {MCKOUT0}] 
set_load -min 5.000000 [get_ports {MCKOUT0}] 
set_load -max 10.000000 [get_ports {MCKOUT1}] 
set_load -min 5.000000 [get_ports {MCKOUT1}] 
set_load -max 10.000000 [get_ports {MSDIN}] 
set_load -min 5.000000 [get_ports {MSDIN}] 
set_load -max 10.000000 [get_ports {MSDOUT}] 
set_load -min 5.000000 [get_ports {MSDOUT}] 
set_load -max 10.000000 [get_ports {MIRQOUT}] 
set_load -min 5.000000 [get_ports {MIRQOUT}] 
set_load -max 5.000000 [get_ports {PD0_DDQM0}] 
set_load -min 2.500000 [get_ports {PD0_DDQM0}] 
set_load -max 5.000000 [get_ports {PD1_DDQM1}] 
set_load -min 2.500000 [get_ports {PD1_DDQM1}] 
set_load -max 5.000000 [get_ports {PD2_DDQM2}] 
set_load -min 2.500000 [get_ports {PD2_DDQM2}] 
set_load -max 5.000000 [get_ports {PD3_DDQM3}] 
set_load -min 2.500000 [get_ports {PD3_DDQM3}] 
set_load -max 5.000000 [get_ports {PD4_DDQM4}] 
set_load -min 2.500000 [get_ports {PD4_DDQM4}] 
set_load -max 5.000000 [get_ports {PD5_DDQM5}] 
set_load -min 2.500000 [get_ports {PD5_DDQM5}] 
set_load -max 5.000000 [get_ports {PD6_DDQM6}] 
set_load -min 2.500000 [get_ports {PD6_DDQM6}] 
set_load -max 5.000000 [get_ports {PD7_DDQM7}] 
set_load -min 2.500000 [get_ports {PD7_DDQM7}] 
set_load -max 10.000000 [get_ports {PJ4_INEXT}] 
set_load -min 5.000000 [get_ports {PJ4_INEXT}] 
set_load -max 10.000000 [get_ports {PJ5_ILDOUT}] 
set_load -min 5.000000 [get_ports {PJ5_ILDOUT}] 
set_load -max 10.000000 [get_ports {PJ6_ILIOA}] 
set_load -min 5.000000 [get_ports {PJ6_ILIOA}] 
set_load -max 10.000000 [get_ports {PJ7_ICLK}] 
set_load -min 5.000000 [get_ports {PJ7_ICLK}] 
set_load -max 10.000000 [get_ports {PI0_ID0}] 
set_load -min 5.000000 [get_ports {PI0_ID0}] 
set_load -max 10.000000 [get_ports {PI1_ID1}] 
set_load -min 5.000000 [get_ports {PI1_ID1}] 
set_load -max 10.000000 [get_ports {PI2_ID2}] 
set_load -min 5.000000 [get_ports {PI2_ID2}] 
set_load -max 10.000000 [get_ports {PI3_ID3}] 
set_load -min 5.000000 [get_ports {PI3_ID3}] 
set_load -max 10.000000 [get_ports {PI4_ID4}] 
set_load -min 5.000000 [get_ports {PI4_ID4}] 
set_load -max 10.000000 [get_ports {PI5_ID5}] 
set_load -min 5.000000 [get_ports {PI5_ID5}] 
set_load -max 10.000000 [get_ports {PI6_ID6}] 
set_load -min 5.000000 [get_ports {PI6_ID6}] 
set_load -max 10.000000 [get_ports {PI7_ID7}] 
set_load -min 5.000000 [get_ports {PI7_ID7}] 
set_load -max 10.000000 [get_ports {PH0_IDREQ0}] 
set_load -min 5.000000 [get_ports {PH0_IDREQ0}] 
set_load -max 10.000000 [get_ports {PH1_IDREQ1}] 
set_load -min 5.000000 [get_ports {PH1_IDREQ1}] 
set_load -max 10.000000 [get_ports {PH2_IDREQ2}] 
set_load -min 5.000000 [get_ports {PH2_IDREQ2}] 
set_load -max 10.000000 [get_ports {PH3_IDREQ3}] 
set_load -min 5.000000 [get_ports {PH3_IDREQ3}] 
set_load -max 10.000000 [get_ports {PH4_IDACK0}] 
set_load -min 5.000000 [get_ports {PH4_IDACK0}] 
set_load -max 10.000000 [get_ports {PH5_IDACK1}] 
set_load -min 5.000000 [get_ports {PH5_IDACK1}] 
set_load -max 10.000000 [get_ports {PH6_IDACK2}] 
set_load -min 5.000000 [get_ports {PH6_IDACK2}] 
set_load -max 10.000000 [get_ports {PH7_IDACK3}] 
set_load -min 5.000000 [get_ports {PH7_IDACK3}] 
set_load -max 10.000000 [get_ports {PC0_IDREQ4}] 
set_load -min 5.000000 [get_ports {PC0_IDREQ4}] 
set_load -max 10.000000 [get_ports {PC1_IDREQ5}] 
set_load -min 5.000000 [get_ports {PC1_IDREQ5}] 
set_load -max 10.000000 [get_ports {PC2_IDREQ6}] 
set_load -min 5.000000 [get_ports {PC2_IDREQ6}] 
set_load -max 10.000000 [get_ports {PC3_IDREQ7}] 
set_load -min 5.000000 [get_ports {PC3_IDREQ7}] 
set_load -max 10.000000 [get_ports {PC4_IDACK4}] 
set_load -min 5.000000 [get_ports {PC4_IDACK4}] 
set_load -max 10.000000 [get_ports {PC5_IDACK5}] 
set_load -min 5.000000 [get_ports {PC5_IDACK5}] 
set_load -max 10.000000 [get_ports {PC6_IDACK6}] 
set_load -min 5.000000 [get_ports {PC6_IDACK6}] 
set_load -max 10.000000 [get_ports {PC7_IDACK7}] 
set_load -min 5.000000 [get_ports {PC7_IDACK7}] 
set_load -max 10.000000 [get_ports {MBYPASS}] 
set_load -min 5.000000 [get_ports {MBYPASS}] 
set_load -max 10.000000 [get_ports {MRESET}] 
set_load -min 5.000000 [get_ports {MRESET}] 
set_load -max 10.000000 [get_ports {MRSTOUT}] 
set_load -min 5.000000 [get_ports {MRSTOUT}] 
set_load -max 10.000000 [get_ports {MTEST}] 
set_load -min 5.000000 [get_ports {MTEST}] 
set_load -max 10.000000 [get_ports {MWAKE}] 
set_load -min 5.000000 [get_ports {MWAKE}] 
set_load -max 10.000000 [get_ports {MIRQ0}] 
set_load -min 5.000000 [get_ports {MIRQ0}] 
set_load -max 10.000000 [get_ports {MIRQ1}] 
set_load -min 5.000000 [get_ports {MIRQ1}] 
set_load -max 10.000000 [get_ports {MRXOUT}] 
set_load -min 5.000000 [get_ports {MRXOUT}] 
set_load -max 10.000000 [get_ports {PJ0_UTX1}] 
set_load -min 5.000000 [get_ports {PJ0_UTX1}] 
set_load -max 10.000000 [get_ports {PJ1_URX1}] 
set_load -min 5.000000 [get_ports {PJ1_URX1}] 
set_load -max 10.000000 [get_ports {PJ2_URTS1}] 
set_load -min 5.000000 [get_ports {PJ2_URTS1}] 
set_load -max 10.000000 [get_ports {PJ3_UCTS1}] 
set_load -min 5.000000 [get_ports {PJ3_UCTS1}] 
set_load -max 10.000000 [get_ports {PE0_UTX2}] 
set_load -min 5.000000 [get_ports {PE0_UTX2}] 
set_load -max 10.000000 [get_ports {PE1_URX2}] 
set_load -min 5.000000 [get_ports {PE1_URX2}] 
set_load -max 10.000000 [get_ports {PE2_URTS2}] 
set_load -min 5.000000 [get_ports {PE2_URTS2}] 
set_load -max 10.000000 [get_ports {PE3_UCTS2}] 
set_load -min 5.000000 [get_ports {PE3_UCTS2}] 
set_load -max 10.000000 [get_ports {PE4_UTX3}] 
set_load -min 5.000000 [get_ports {PE4_UTX3}] 
set_load -max 10.000000 [get_ports {PE5_URX3}] 
set_load -min 5.000000 [get_ports {PE5_URX3}] 
set_load -max 10.000000 [get_ports {PE6_URTS3}] 
set_load -min 5.000000 [get_ports {PE6_URTS3}] 
set_load -max 10.000000 [get_ports {PE7_UCTS3}] 
set_load -min 5.000000 [get_ports {PE7_UCTS3}] 
set_load -max 10.000000 [get_ports {PF0_ETXEN}] 
set_load -min 2.500000 [get_ports {PF0_ETXEN}] 
set_load -max 10.000000 [get_ports {PF1_ETXCLK}] 
set_load -min 2.500000 [get_ports {PF1_ETXCLK}] 
set_load -max 10.000000 [get_ports {PF2_ETXD0}] 
set_load -min 2.500000 [get_ports {PF2_ETXD0}] 
set_load -max 10.000000 [get_ports {PF3_ETXD1}] 
set_load -min 2.500000 [get_ports {PF3_ETXD1}] 
set_load -max 10.000000 [get_ports {PF4_ERXDV}] 
set_load -min 2.500000 [get_ports {PF4_ERXDV}] 
set_load -max 10.000000 [get_ports {PF5_ERXER}] 
set_load -min 2.500000 [get_ports {PF5_ERXER}] 
set_load -max 10.000000 [get_ports {PF6_ERXD0}] 
set_load -min 2.500000 [get_ports {PF6_ERXD0}] 
set_load -max 10.000000 [get_ports {PF7_ERXD1}] 
set_load -min 2.500000 [get_ports {PF7_ERXD1}] 
set_load -max 10.000000 [get_ports {PG0_ETXER}] 
set_load -min 2.500000 [get_ports {PG0_ETXER}] 
set_load -max 10.000000 [get_ports {PG1_ERXCLK}] 
set_load -min 2.500000 [get_ports {PG1_ERXCLK}] 
set_load -max 10.000000 [get_ports {PG2_ETXD2}] 
set_load -min 2.500000 [get_ports {PG2_ETXD2}] 
set_load -max 10.000000 [get_ports {PG3_ETXD3}] 
set_load -min 2.500000 [get_ports {PG3_ETXD3}] 
set_load -max 10.000000 [get_ports {PG4_ECOL}] 
set_load -min 2.500000 [get_ports {PG4_ECOL}] 
set_load -max 10.000000 [get_ports {PG5_ECRS}] 
set_load -min 2.500000 [get_ports {PG5_ECRS}] 
set_load -max 10.000000 [get_ports {PG6_ERXD2}] 
set_load -min 2.500000 [get_ports {PG6_ERXD2}] 
set_load -max 10.000000 [get_ports {PG7_ERXD3}] 
set_load -min 2.500000 [get_ports {PG7_ERXD3}] 
set_load -max 10.000000 [get_ports {PA0}] 
set_load -min 5.000000 [get_ports {PA0}] 
set_load -max 10.000000 [get_ports {PA1}] 
set_load -min 5.000000 [get_ports {PA1}] 
set_load -max 10.000000 [get_ports {PA2}] 
set_load -min 5.000000 [get_ports {PA2}] 
set_load -max 10.000000 [get_ports {PA3}] 
set_load -min 5.000000 [get_ports {PA3}] 
set_load -max 10.000000 [get_ports {PA4}] 
set_load -min 5.000000 [get_ports {PA4}] 
set_load -max 10.000000 [get_ports {PA5}] 
set_load -min 5.000000 [get_ports {PA5}] 
set_load -max 10.000000 [get_ports {PA6}] 
set_load -min 5.000000 [get_ports {PA6}] 
set_load -max 10.000000 [get_ports {PA7}] 
set_load -min 5.000000 [get_ports {PA7}] 
set_load -max 10.000000 [get_ports {PB0}] 
set_load -min 5.000000 [get_ports {PB0}] 
set_load -max 10.000000 [get_ports {PB1}] 
set_load -min 5.000000 [get_ports {PB1}] 
set_load -max 10.000000 [get_ports {PB2}] 
set_load -min 5.000000 [get_ports {PB2}] 
set_load -max 10.000000 [get_ports {PB3}] 
set_load -min 5.000000 [get_ports {PB3}] 
set_load -max 10.000000 [get_ports {PB4}] 
set_load -min 5.000000 [get_ports {PB4}] 
set_load -max 10.000000 [get_ports {PB5}] 
set_load -min 5.000000 [get_ports {PB5}] 
set_load -max 10.000000 [get_ports {PB6}] 
set_load -min 5.000000 [get_ports {PB6}] 
set_load -max 10.000000 [get_ports {PB7}] 
set_load -min 5.000000 [get_ports {PB7}] 
set_load -max 13.000000 [get_ports {DDQ0}] 
set_load -min 4.000000 [get_ports {DDQ0}] 
set_load -max 13.000000 [get_ports {DDQ1}] 
set_load -min 4.000000 [get_ports {DDQ1}] 
set_load -max 13.000000 [get_ports {DDQ2}] 
set_load -min 4.000000 [get_ports {DDQ2}] 
set_load -max 13.000000 [get_ports {DDQ3}] 
set_load -min 4.000000 [get_ports {DDQ3}] 
set_load -max 13.000000 [get_ports {DDQ4}] 
set_load -min 4.000000 [get_ports {DDQ4}] 
set_load -max 13.000000 [get_ports {DDQ5}] 
set_load -min 4.000000 [get_ports {DDQ5}] 
set_load -max 13.000000 [get_ports {DDQ6}] 
set_load -min 4.000000 [get_ports {DDQ6}] 
set_load -max 13.000000 [get_ports {DDQ7}] 
set_load -min 4.000000 [get_ports {DDQ7}] 
set_load -max 8.000000 [get_ports {DCLK}] 
set_load -min 2.500000 [get_ports {DCLK}] 
set_load -max 10.000000 [get_ports {DCS}] 
set_load -min 2.500000 [get_ports {DCS}] 
set_load -max 10.000000 [get_ports {DRAS}] 
set_load -min 2.500000 [get_ports {DRAS}] 
set_load -max 10.000000 [get_ports {DCAS}] 
set_load -min 2.500000 [get_ports {DCAS}] 
set_load -max 10.000000 [get_ports {DWE}] 
set_load -min 2.500000 [get_ports {DWE}] 
set_load -max 10.000000 [get_ports {DBA0}] 
set_load -min 2.500000 [get_ports {DBA0}] 
set_load -max 10.000000 [get_ports {DBA1}] 
set_load -min 2.500000 [get_ports {DBA1}] 
set_load -max 10.000000 [get_ports {DA0}] 
set_load -min 2.500000 [get_ports {DA0}] 
set_load -max 10.000000 [get_ports {DA1}] 
set_load -min 2.500000 [get_ports {DA1}] 
set_load -max 10.000000 [get_ports {DA2}] 
set_load -min 2.500000 [get_ports {DA2}] 
set_load -max 10.000000 [get_ports {DA3}] 
set_load -min 2.500000 [get_ports {DA3}] 
set_load -max 10.000000 [get_ports {DA4}] 
set_load -min 2.500000 [get_ports {DA4}] 
set_load -max 10.000000 [get_ports {DA5}] 
set_load -min 2.500000 [get_ports {DA5}] 
set_load -max 10.000000 [get_ports {DA6}] 
set_load -min 2.500000 [get_ports {DA6}] 
set_load -max 10.000000 [get_ports {DA7}] 
set_load -min 2.500000 [get_ports {DA7}] 
set_load -max 10.000000 [get_ports {DA8}] 
set_load -min 2.500000 [get_ports {DA8}] 
set_load -max 10.000000 [get_ports {DA9}] 
set_load -min 2.500000 [get_ports {DA9}] 
set_load -max 10.000000 [get_ports {DA10}] 
set_load -min 2.500000 [get_ports {DA10}] 
set_load -max 10.000000 [get_ports {DA11}] 
set_load -min 2.500000 [get_ports {DA11}] 
set_load -max 10.000000 [get_ports {DA12}] 
set_load -min 2.500000 [get_ports {DA12}] 
set_load -max 10.000000 [get_ports {DA13}] 
set_load -min 2.500000 [get_ports {DA13}] 
set_load -max 10.000000 [get_ports {DCKE0}] 
set_load -min 2.500000 [get_ports {DCKE0}] 
set_load -max 10.000000 [get_ports {DCKE1}] 
set_load -min 2.500000 [get_ports {DCKE1}] 
set_load -max 10.000000 [get_ports {DCKE2}] 
set_load -min 2.500000 [get_ports {DCKE2}] 
set_load -max 10.000000 [get_ports {DCKE3}] 
set_load -min 2.500000 [get_ports {DCKE3}] 
set_load -max 10.000000 [get_ports {MPORDIS}] 
set_load -min 5.000000 [get_ports {MPORDIS}] 
set_load -max 10.000000 [get_ports {MPLL_TSTO}] 
set_load -min 5.000000 [get_ports {MPLL_TSTO}] 

# Driving Cell Constraints

# Input Delay Constraints
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ7_ICLK}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ7_ICLK}] 

set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD0_DDQM0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD0_DDQM0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD1_DDQM1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD1_DDQM1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD2_DDQM2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD2_DDQM2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD3_DDQM3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD3_DDQM3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD4_DDQM4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD4_DDQM4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD5_DDQM5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD5_DDQM5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD6_DDQM6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD6_DDQM6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PD7_DDQM7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PD7_DDQM7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ4_INEXT}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ4_INEXT}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ5_ILDOUT}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ5_ILDOUT}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ6_ILIOA}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ6_ILIOA}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI0_ID0}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI0_ID0}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI0_ID0}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI0_ID0}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI1_ID1}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI1_ID1}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI1_ID1}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI1_ID1}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI2_ID2}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI2_ID2}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI2_ID2}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI2_ID2}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI3_ID3}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI3_ID3}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI3_ID3}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI3_ID3}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI4_ID4}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI4_ID4}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI4_ID4}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI4_ID4}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI5_ID5}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI5_ID5}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI5_ID5}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI5_ID5}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI6_ID6}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI6_ID6}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI6_ID6}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI6_ID6}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -rise [get_ports {PI7_ID7}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PI7_ID7}] 
set_input_delay -max 8.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI7_ID7}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI7_ID7}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PH0_IDREQ0}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PH0_IDREQ0}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH0_IDREQ0}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH0_IDREQ0}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PH1_IDREQ1}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PH1_IDREQ1}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH1_IDREQ1}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH1_IDREQ1}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PH2_IDREQ2}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PH2_IDREQ2}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH2_IDREQ2}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH2_IDREQ2}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PH3_IDREQ3}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PH3_IDREQ3}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH3_IDREQ3}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH3_IDREQ3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH4_IDACK0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH4_IDACK0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH5_IDACK1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH5_IDACK1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH6_IDACK2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH6_IDACK2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH7_IDACK3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH7_IDACK3}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PC0_IDREQ4}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PC0_IDREQ4}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC0_IDREQ4}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC0_IDREQ4}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PC1_IDREQ5}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PC1_IDREQ5}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC1_IDREQ5}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC1_IDREQ5}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PC2_IDREQ6}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PC2_IDREQ6}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC2_IDREQ6}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC2_IDREQ6}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PC3_IDREQ7}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -rise [get_ports {PC3_IDREQ7}] 
set_input_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC3_IDREQ7}] 
set_input_delay -min 0.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC3_IDREQ7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC4_IDACK4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC4_IDACK4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC5_IDACK5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC5_IDACK5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC6_IDACK6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC6_IDACK6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC7_IDACK7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC7_IDACK7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ0_UTX1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ0_UTX1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ1_URX1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ1_URX1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ2_URTS1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ2_URTS1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ3_UCTS1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ3_UCTS1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE0_UTX2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE0_UTX2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE1_URX2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE1_URX2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE2_URTS2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE2_URTS2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE3_UCTS2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE3_UCTS2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE4_UTX3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE4_UTX3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE5_URX3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE5_URX3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE6_URTS3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE6_URTS3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE7_UCTS3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE7_UCTS3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF0_ETXEN}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF0_ETXEN}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF1_ETXCLK}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF1_ETXCLK}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF2_ETXD0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF2_ETXD0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF3_ETXD1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF3_ETXD1}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PF4_ERXDV}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF4_ERXDV}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PF4_ERXDV}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF4_ERXDV}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PF5_ERXER}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF5_ERXER}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PF5_ERXER}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF5_ERXER}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PF6_ERXD0}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF6_ERXD0}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PF6_ERXD0}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF6_ERXD0}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PF7_ERXD1}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF7_ERXD1}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PF7_ERXD1}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PF7_ERXD1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG0_ETXER}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG0_ETXER}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG1_ERXCLK}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG1_ERXCLK}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG2_ETXD2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG2_ETXD2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG3_ETXD3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG3_ETXD3}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PG4_ECOL}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG4_ECOL}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PG4_ECOL}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG4_ECOL}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PG5_ECRS}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG5_ECRS}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PG5_ECRS}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG5_ECRS}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PG6_ERXD2}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG6_ERXD2}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PG6_ERXD2}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG6_ERXD2}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -rise [get_ports {PG7_ERXD3}] 
set_input_delay -max 16.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG7_ERXD3}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -rise [get_ports {PG7_ERXD3}] 
set_input_delay -min 2.000000 -clock {clk_ERXCLK} -fall -add_delay [get_ports {PG7_ERXD3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB4}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB5}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB6}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB7}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB7}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ0}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ0}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ0}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ0}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ1}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ1}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ1}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ1}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ2}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ2}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ2}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ2}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ3}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ3}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ3}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ3}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ4}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ4}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ4}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ4}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ5}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ5}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ5}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ5}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ6}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ6}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ6}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ6}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -rise [get_ports {DDQ7}] 
set_input_delay -max 5.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ7}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -rise [get_ports {DDQ7}] 
set_input_delay -min 2.060000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ7}] 

set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF4_ERXDV}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF4_ERXDV}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF5_ERXER}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF5_ERXER}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF6_ERXD0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF6_ERXD0}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF7_ERXD1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF7_ERXD1}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG4_ECOL}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG4_ECOL}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG5_ECRS}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG5_ECRS}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG6_ERXD2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG6_ERXD2}] 
set_input_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG7_ERXD3}] 
set_input_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG7_ERXD3}] 

# Output Delay Constraints
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD0_DDQM0}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD0_DDQM0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD0_DDQM0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD0_DDQM0}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD1_DDQM1}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD1_DDQM1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD1_DDQM1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD1_DDQM1}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD2_DDQM2}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD2_DDQM2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD2_DDQM2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD2_DDQM2}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD3_DDQM3}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD3_DDQM3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD3_DDQM3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD3_DDQM3}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD4_DDQM4}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD4_DDQM4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD4_DDQM4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD4_DDQM4}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD5_DDQM5}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD5_DDQM5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD5_DDQM5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD5_DDQM5}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD6_DDQM6}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD6_DDQM6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD6_DDQM6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD6_DDQM6}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {PD7_DDQM7}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD7_DDQM7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {PD7_DDQM7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {PD7_DDQM7}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -rise [get_ports {PJ4_INEXT}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ4_INEXT}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PJ4_INEXT}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ4_INEXT}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -rise [get_ports {PJ5_ILDOUT}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ5_ILDOUT}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PJ5_ILDOUT}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ5_ILDOUT}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -rise [get_ports {PJ6_ILIOA}] 
set_output_delay -max 7.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ6_ILIOA}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PJ6_ILIOA}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ6_ILIOA}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI0_ID0}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI0_ID0}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI0_ID0}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI0_ID0}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI1_ID1}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI1_ID1}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI1_ID1}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI1_ID1}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI2_ID2}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI2_ID2}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI2_ID2}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI2_ID2}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI3_ID3}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI3_ID3}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI3_ID3}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI3_ID3}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI4_ID4}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI4_ID4}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI4_ID4}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI4_ID4}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI5_ID5}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI5_ID5}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI5_ID5}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI5_ID5}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI6_ID6}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI6_ID6}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI6_ID6}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI6_ID6}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -rise [get_ports {PI7_ID7}] 
set_output_delay -max 4.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI7_ID7}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PI7_ID7}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PI7_ID7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH0_IDREQ0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH0_IDREQ0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH1_IDREQ1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH1_IDREQ1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH2_IDREQ2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH2_IDREQ2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PH3_IDREQ3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH3_IDREQ3}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PH4_IDACK0}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH4_IDACK0}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PH4_IDACK0}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH4_IDACK0}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PH5_IDACK1}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH5_IDACK1}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PH5_IDACK1}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH5_IDACK1}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PH6_IDACK2}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH6_IDACK2}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PH6_IDACK2}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH6_IDACK2}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PH7_IDACK3}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH7_IDACK3}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PH7_IDACK3}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PH7_IDACK3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC0_IDREQ4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC0_IDREQ4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC1_IDREQ5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC1_IDREQ5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC2_IDREQ6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC2_IDREQ6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PC3_IDREQ7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC3_IDREQ7}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PC4_IDACK4}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC4_IDACK4}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PC4_IDACK4}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC4_IDACK4}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PC5_IDACK5}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC5_IDACK5}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PC5_IDACK5}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC5_IDACK5}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PC6_IDACK6}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC6_IDACK6}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PC6_IDACK6}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC6_IDACK6}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -rise [get_ports {PC7_IDACK7}] 
set_output_delay -max 5.500000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC7_IDACK7}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -rise [get_ports {PC7_IDACK7}] 
set_output_delay -min -1.000000 -clock {clk_ICLK} -fall -add_delay [get_ports {PC7_IDACK7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ0_UTX1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ0_UTX1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ1_URX1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ1_URX1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ2_URTS1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ2_URTS1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PJ3_UCTS1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PJ3_UCTS1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE0_UTX2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE0_UTX2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE1_URX2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE1_URX2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE2_URTS2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE2_URTS2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE3_UCTS2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE3_UCTS2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE4_UTX3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE4_UTX3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE5_URX3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE5_URX3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE6_URTS3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE6_URTS3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PE7_UCTS3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PE7_UCTS3}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PF0_ETXEN}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF0_ETXEN}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PF0_ETXEN}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF0_ETXEN}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF1_ETXCLK}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF1_ETXCLK}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PF2_ETXD0}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF2_ETXD0}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PF2_ETXD0}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF2_ETXD0}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PF3_ETXD1}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF3_ETXD1}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PF3_ETXD1}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PF3_ETXD1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF4_ERXDV}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF4_ERXDV}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF5_ERXER}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF5_ERXER}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF6_ERXD0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF6_ERXD0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF7_ERXD1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF7_ERXD1}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PG0_ETXER}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG0_ETXER}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PG0_ETXER}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG0_ETXER}] 
set_output_delay -max 0.100000 -clock {clk_ICLK} -rise [get_ports {PG1_ERXCLK}] 
set_output_delay -max 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG1_ERXCLK}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PG2_ETXD2}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG2_ETXD2}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PG2_ETXD2}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG2_ETXD2}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -rise [get_ports {PG3_ETXD3}] 
set_output_delay -max 4.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG3_ETXD3}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -rise [get_ports {PG3_ETXD3}] 
set_output_delay -min -2.000000 -clock {clk_ETXCLK} -fall -add_delay [get_ports {PG3_ETXD3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG4_ECOL}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG4_ECOL}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG5_ECRS}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG5_ECRS}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG6_ERXD2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG6_ERXD2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG7_ERXD3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG7_ERXD3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PA7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PA7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB4}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB5}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB6}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PB7}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PB7}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ0}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ0}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ1}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ1}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ2}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ2}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ3}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ3}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ4}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ4}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ5}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ5}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ6}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ6}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -rise [get_ports {DDQ7}] 
set_output_delay -max 1.820000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DDQ7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DDQ7}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DRAS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DRAS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DRAS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DRAS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCAS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCAS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCAS}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCAS}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DWE}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DWE}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DWE}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DWE}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DBA0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DBA0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DBA0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DBA0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DBA1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DBA1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DBA1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DBA1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA2}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA2}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA3}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA3}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA4}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA4}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA4}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA5}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA5}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA5}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA6}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA6}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA6}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA7}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA7}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA7}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA8}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA8}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA8}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA8}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA9}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA9}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA9}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA9}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA10}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA10}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA10}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA10}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA11}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA11}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA11}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA11}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA12}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA12}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA12}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA12}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DA13}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA13}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DA13}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DA13}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCKE0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCKE0}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE0}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCKE1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCKE1}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE1}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCKE2}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCKE2}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE2}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -rise [get_ports {DCKE3}] 
set_output_delay -max 1.500000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -rise [get_ports {DCKE3}] 
set_output_delay -min -1.000000 -clock {clk_DCLK} -fall -add_delay [get_ports {DCKE3}] 

set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF0_ETXEN}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF0_ETXEN}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF2_ETXD0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF2_ETXD0}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PF3_ETXD1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PF3_ETXD1}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG0_ETXER}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG0_ETXER}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG2_ETXD2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG2_ETXD2}] 
set_output_delay 0.100000 -clock {clk_ICLK} -rise [get_ports {PG3_ETXD3}] 
set_output_delay 0.100000 -clock {clk_ICLK} -fall -add_delay [get_ports {PG3_ETXD3}] 

# Wire Loads
set_wire_load_mode enclosed
set_wire_load_model -name G50K -library fsa0a_c_sc_wc top

## SDRAM input transitions
#force timing slew $m/DDQ*:in 1200p
set_input_transition -rise -max 1.200 [get_ports {DDQ0}]
set_input_transition -fall -max 1.200 [get_ports {DDQ0}]
set_input_transition -rise -min 1.200 [get_ports {DDQ0}]
set_input_transition -fall -min 1.200 [get_ports {DDQ0}]
set_input_transition -rise -max 1.200 [get_ports {DDQ1}]
set_input_transition -fall -max 1.200 [get_ports {DDQ1}]
set_input_transition -rise -min 1.200 [get_ports {DDQ1}]
set_input_transition -fall -min 1.200 [get_ports {DDQ1}]
set_input_transition -rise -max 1.200 [get_ports {DDQ2}]
set_input_transition -fall -max 1.200 [get_ports {DDQ2}]
set_input_transition -rise -min 1.200 [get_ports {DDQ2}]
set_input_transition -fall -min 1.200 [get_ports {DDQ2}]
set_input_transition -rise -max 1.200 [get_ports {DDQ3}]
set_input_transition -fall -max 1.200 [get_ports {DDQ3}]
set_input_transition -rise -min 1.200 [get_ports {DDQ3}]
set_input_transition -fall -min 1.200 [get_ports {DDQ3}]
set_input_transition -rise -max 1.200 [get_ports {DDQ4}]
set_input_transition -fall -max 1.200 [get_ports {DDQ4}]
set_input_transition -rise -min 1.200 [get_ports {DDQ4}]
set_input_transition -fall -min 1.200 [get_ports {DDQ4}]
set_input_transition -rise -max 1.200 [get_ports {DDQ5}]
set_input_transition -fall -max 1.200 [get_ports {DDQ5}]
set_input_transition -rise -min 1.200 [get_ports {DDQ5}]
set_input_transition -fall -min 1.200 [get_ports {DDQ5}]
set_input_transition -rise -max 1.200 [get_ports {DDQ6}]
set_input_transition -fall -max 1.200 [get_ports {DDQ6}]
set_input_transition -rise -min 1.200 [get_ports {DDQ6}]
set_input_transition -fall -min 1.200 [get_ports {DDQ6}]
set_input_transition -rise -max 1.200 [get_ports {DDQ7}]
set_input_transition -fall -max 1.200 [get_ports {DDQ7}]
set_input_transition -rise -min 1.200 [get_ports {DDQ7}]
set_input_transition -fall -min 1.200 [get_ports {DDQ7}]

